chettrick/discobsd/discobsd/sys/stm32/machdep.c
    LL_RCC_PLL_Enable();
    while(LL_RCC_PLL_IsReady() != 1)
    {
    };

    /* Sysclk activation on the main PLL */
    LL_RCC_SetAHBPrescaler(LL_RCC_SYSCLK_DIV_1);
    LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_PLL);
    while(LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_PLL)
    {
    };

    /* Set APB1 & APB2 prescaler */
#ifdef STM32F407xx      /* 168 MHz */
    LL_RCC_SetAPB1Prescaler(LL_RCC_APB1_DIV_4);
#endif /* STM32F407xx */
#ifdef STM32F469xx      /* 180 MHz */
    LL_RCC_SetAPB1Prescaler(LL_RCC_APB1_DIV_2);
#endif /* STM32F469xx */
    LL_RCC_SetAPB2Prescaler(LL_RCC_APB2_DIV_2);

    /* Set systick to 1ms */
    SysTick_Config(CPU_KHZ);

    /* Update CMSIS variable (or through SystemCoreClockUpdate()) */
    SystemCoreClock = CPU_KHZ * 1000;
}

/*
 * Check whether button 1 is pressed.
 */
static inline int
button1_pressed()
{
#ifdef BUTTON1_PORT
    int val;

    TRIS_SET(BUTTON1_PORT) = 1 << BUTTON1_PIN;
    val = PORT_VAL(BUTTON1_PORT);
#ifdef BUTTON1_INVERT
    val = ~val;
#endif
    return (val >> BUTTON1_PIN) & 1;
#else
    return 0;
#endif
}

/*
 * Machine dependent startup code
 */
void
startup()
{
    HAL_Init();

    SystemClock_Config();

    BSP_LED_Init(LED1); // Green.
    BSP_LED_Init(LED2); // Orange.
    BSP_LED_Init(LED3); // Red.
    BSP_LED_Init(LED4); // Blue.

    BSP_LED_On(LED_ORANGE);
    BSP_LED_On(LED_BLUE);

#if 0 // XXX
    extern void _etext(), _exception_base_();
    extern unsigned __data_start;

    /* Initialize STATUS register: master interrupt disable.
     * Setup interrupt vector base. */
    mips_write_c0_register(C0_STATUS, 0, ST_CU0 | ST_BEV);
    mips_write_c0_register(C0_EBASE, 1, _exception_base_);
    mips_write_c0_register(C0_STATUS, 0, ST_CU0);

    /* Set vector spacing: not used really, but must be nonzero. */
    mips_write_c0_register(C0_INTCTL, 1, 32);

    /* Clear CAUSE register: use special interrupt vector 0x200. */
    mips_write_c0_register(C0_CAUSE, 0, CA_IV);

    /* Setup memory. */
    BMXPUPBA = 512 << 10;               /* Kernel Flash memory size */
#ifdef KERNEL_EXECUTABLE_RAM
    /*
     * Set boundry for kernel executable ram on smallest
     * 2k boundry required to allow the keram segment to fit.
     * This means that there is possibly some u0area ramspace that
     * is executable, but as it is isolated from userspace this
     * should be ok, given the apparent goals of this project.
     */
    extern void _keram_start(), _keram_end();
    unsigned keram_size = (((char*)&_keram_end-(char*)&_keram_start+(2<<10))/(2<<10)*(2<<10));
    BMXDKPBA = ((32<<10)-keram_size);   /* Kernel RAM size */
    BMXDUDBA = BMXDKPBA+(keram_size);   /* Executable RAM in kernel */
#else
    BMXDKPBA = 32 << 10;                /* Kernel RAM size */
    BMXDUDBA = BMXDKPBA;                /* Zero executable RAM in kernel */
#endif
    BMXDUPBA = BMXDUDBA;                /* All user RAM is executable */

    /*
     * Setup interrupt controller.
     */
    INTCON = 0;                         /* Interrupt Control */
    IPTMR = 0;                          /* Temporal Proximity Timer */

    /* Interrupt Flag Status */
    IFS(0) = PIC32_IPC_IP0(2) | PIC32_IPC_IP1(1) |
             PIC32_IPC_IP2(1) | PIC32_IPC_IP3(1) |
             PIC32_IPC_IS0(0) | PIC32_IPC_IS1(0) |
             PIC32_IPC_IS2(0) | PIC32_IPC_IS3(0) ;
    IFS(1) = 0;
    IFS(2) = 0;

    /* Interrupt Enable Control */
    IEC(0) = 0;
    IEC(1) = 0;
    IEC(2) = 0;

    /* Interrupt Priority Control */
    unsigned ipc = PIC32_IPC_IP0(1) | PIC32_IPC_IP1(1) |
                   PIC32_IPC_IP2(1) | PIC32_IPC_IP3(1) |
                   PIC32_IPC_IS0(0) | PIC32_IPC_IS1(0) |
                   PIC32_IPC_IS2(0) | PIC32_IPC_IS3(0) ;
    IPC(0) = ipc;
    IPC(1) = ipc;
    IPC(2) = ipc;
    IPC(3) = ipc;
    IPC(4) = ipc;
    IPC(5) = ipc;
    IPC(6) = ipc;
    IPC(7) = ipc;
    IPC(8) = ipc;
    IPC(9) = ipc;
    IPC(10) = ipc;
    IPC(11) = ipc;
    IPC(12) = ipc;

    /*
     * Setup wait states.
     */
    CHECON = 2;
    BMXCONCLR = 0x40;
    CHECONSET = 0x30;

    /* Disable JTAG port, to use it for i/o. */
    DDPCON = 0;

    /* Use all B ports as digital. */
    AD1PCFG = ~0;

    /* Config register: enable kseg0 caching. */
    mips_write_c0_register(C0_CONFIG, 0,
    mips_read_c0_register(C0_CONFIG, 0) | 3);

    /* Kernel mode, interrupts disabled.  */
    mips_write_c0_register(C0_STATUS, 0, ST_CU0);
    mips_ehb();

    /*
     * Configure LED pins.
     */
#ifdef LED_TTY_PORT                     /* Terminal i/o */
    LED_TTY_OFF();
    TRIS_CLR(LED_TTY_PORT) = 1 << LED_TTY_PIN;
#endif
#ifdef LED_DISK_PORT                    /* Disk i/o */
    LED_DISK_OFF();
    TRIS_CLR(LED_DISK_PORT) = 1 << LED_DISK_PIN;
#endif
#ifdef LED_KERNEL_PORT                  /* Kernel activity */
    LED_KERNEL_OFF();
    TRIS_CLR(LED_KERNEL_PORT) = 1 << LED_KERNEL_PIN;
#endif
#ifdef LED_SWAP_PORT                    /* Auxiliary */
    LED_SWAP_OFF();
    TRIS_CLR(LED_SWAP_PORT) = 1 << LED_SWAP_PIN;
#endif
#ifdef GPIO_CLEAR_PORT                  /* Clear pin */
    LAT_CLR(GPIO_CLEAR_PORT) = 1 << GPIO_CLEAR_PIN;
    TRIS_CLR(GPIO_CLEAR_PORT) = 1 << GPIO_CLEAR_PIN;
#endif
#ifdef POWER_ENABLED
    power_init();
#endif

    //SETVAL(0);

    /* Initialize .data + .bss segments by zeroes. */
    bzero(&__data_start, KERNEL_DATA_SIZE - 96);

#if __MPLABX__
    /* Microchip C32 compiler generates a .dinit table with
     * initialization values for .data segment. */
    extern const unsigned _dinit_addr[];
    unsigned const *dinit = &_dinit_addr[0];
    for (;;) {
        char *dst = (char*) (*dinit++);
        if (dst == 0)
            break;

        unsigned nbytes = *dinit++;
        unsigned fmt = *dinit++;
        if (fmt == 0) {                 /* Clear */
            do {
                *dst++ = 0;
            } while (--nbytes > 0);
        } else {                        /* Copy */
            char *src = (char*) dinit;
            do {
                *dst++ = *src++;
            } while (--nbytes > 0);
            dinit = (unsigned*) ((unsigned) (src + 3) & ~3);
        }
    }
#else
    /* Copy the .data image from flash to ram.
     * Linker places it at the end of .text segment. */
    extern unsigned _edata;
    unsigned *src = (unsigned*) &_etext;
    unsigned *dest = &__data_start;
    unsigned *limit = &_edata;
    while (dest < limit) {
        /*printf("copy %08x from (%08x) to (%08x)\n", *src, src, dest);*/
        *dest++ = *src++;
    }

#ifdef KERNEL_EXECUTABLE_RAM
    /* Copy code that must run out of ram (due to timing restrictions)
     * from flash to the executable section of kernel ram.
     * This was added to support swap on sdram */

